{
  "additional_special_tokens": [
    "<tool_call>",
    "</tool_call>",
    "<|fim_prefix|>",
    "<|fim_middle|>",
    "<|fim_suffix|>",
    "<|reserved_token_6|>",
    "<|reserved_token_7|>",
    "<|reserved_token_8|>",
    "<|reserved_token_9|>",
    "<|reserved_token_10|>",
    "<|reserved_token_11|>",
    "<|reserved_token_12|>",
    "<|reserved_token_13|>",
    "<|reserved_token_14|>",
    "<|reserved_token_15|>",
    "<|reserved_token_16|>",
    "<|reserved_token_17|>",
    "<|reserved_token_18|>",
    "<|reserved_token_19|>",
    "<|reserved_token_20|>",
    "<|reserved_token_21|>",
    "<|reserved_token_22|>",
    "<|reserved_token_23|>",
    "<|reserved_token_24|>",
    "<|reserved_token_25|>",
    "<|reserved_token_26|>",
    "<|reserved_token_27|>",
    "<|reserved_token_28|>",
    "<|reserved_token_29|>",
    "<|reserved_token_30|>",
    "<|reserved_token_31|>",
    "<|reserved_token_32|>",
    "<|reserved_token_33|>",
    "<|reserved_token_34|>",
    "<|reserved_token_35|>",
    "<|reserved_token_36|>",
    "<|reserved_token_37|>",
    "<|reserved_token_38|>",
    "<|reserved_token_39|>",
    "<|reserved_token_40|>",
    "<|reserved_token_41|>",
    "<|reserved_token_42|>",
    "<|reserved_token_43|>",
    "<|reserved_token_44|>",
    "<|reserved_token_45|>",
    "<|reserved_token_46|>",
    "<|reserved_token_47|>",
    "<|reserved_token_48|>",
    "<|reserved_token_49|>",
    "<|reserved_token_50|>",
    "<|reserved_token_51|>",
    "<|reserved_token_52|>",
    "<|reserved_token_53|>",
    "<|reserved_token_54|>",
    "<|reserved_token_55|>",
    "<|reserved_token_56|>",
    "<|reserved_token_57|>",
    "<|reserved_token_58|>",
    "<|reserved_token_59|>",
    "<|reserved_token_60|>",
    "<|reserved_token_61|>",
    "<|reserved_token_62|>",
    "<|reserved_token_63|>",
    "<|reserved_token_64|>",
    "<|reserved_token_65|>",
    "<|reserved_token_66|>",
    "<|reserved_token_67|>",
    "<|reserved_token_68|>",
    "<|reserved_token_69|>",
    "<|reserved_token_70|>",
    "<|reserved_token_71|>",
    "<|reserved_token_72|>",
    "<|reserved_token_73|>",
    "<|reserved_token_74|>",
    "<|reserved_token_75|>",
    "<|reserved_token_76|>",
    "<|reserved_token_77|>",
    "<|reserved_token_78|>",
    "<|reserved_token_79|>",
    "<|reserved_token_80|>",
    "<|reserved_token_81|>",
    "<|reserved_token_82|>",
    "<|reserved_token_83|>",
    "<|reserved_token_84|>",
    "<|reserved_token_85|>",
    "<|reserved_token_86|>",
    "<|reserved_token_87|>",
    "<|reserved_token_88|>",
    "<|reserved_token_89|>",
    "<|reserved_token_90|>",
    "<|reserved_token_91|>",
    "<|reserved_token_92|>",
    "<|reserved_token_93|>",
    "<|reserved_token_94|>",
    "<|reserved_token_95|>",
    "<|reserved_token_96|>",
    "<|reserved_token_97|>",
    "<|reserved_token_98|>",
    "<|reserved_token_99|>",
    "<|reserved_token_100|>",
    "<|reserved_token_101|>",
    "<|reserved_token_102|>",
    "<|reserved_token_103|>",
    "<|reserved_token_104|>",
    "<|reserved_token_105|>",
    "<|reserved_token_106|>",
    "<|reserved_token_107|>",
    "<|reserved_token_108|>",
    "<|reserved_token_109|>",
    "<|reserved_token_110|>",
    "<|reserved_token_111|>",
    "<|reserved_token_112|>",
    "<|reserved_token_113|>",
    "<|reserved_token_114|>",
    "<|reserved_token_115|>",
    "<|reserved_token_116|>",
    "<|reserved_token_117|>",
    "<|reserved_token_118|>",
    "<|reserved_token_119|>",
    "<|reserved_token_120|>",
    "<|reserved_token_121|>"
  ],
  "bos_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "eos_token": {
    "content": "<|im_end|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<|pad|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "unk_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
